; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-16)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city8)
	(fuel-level plane1 fl3)
	(at plane2 city10)
	(fuel-level plane2 fl1)
	(at plane3 city3)
	(fuel-level plane3 fl4)
	(at person1 city6)
	(at person2 city11)
	(at person3 city10)
	(at person4 city8)
	(at person5 city4)
	(at person6 city3)
	(at person7 city11)
	(at person8 city7)
	(at person9 city11)
	(at person10 city9)
	(at person11 city1)
	(at person12 city9)
	(at person13 city10)
	(at person14 city2)
	(at person15 city10)
	(at person16 city5)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city1)
	(at person3 city11)
	(at person4 city1)
	(at person5 city3)
	(at person6 city2)
	(at person7 city9)
	(at person8 city1)
	(at person9 city1)
	(at person10 city6)
	(at person11 city0)
	(at person12 city0)
	(at person13 city10)
	(at person14 city7)
	(at person15 city11)
	(at person16 city2)
	))

)

; plan
1. (board person6 plane3 city3)
   deleted: (at person6 city3)
   added: (in person6 plane3)
   goals met: 1 of 15
2. (zoom plane3 city3 city2 fl4 fl3 fl2)
   deleted: (at plane3 city3) (fuel-level plane3 fl4)
   added: (at plane3 city2) (fuel-level plane3 fl2)
   goals met: 1 of 15
3. (debark person6 plane3 city2)
   deleted: (in person6 plane3)
   added: (at person6 city2)
   goals met: 2 of 15
4. (board person14 plane3 city2)
   deleted: (at person14 city2)
   added: (in person14 plane3)
   goals met: 2 of 15
5. (zoom plane3 city2 city7 fl2 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl2)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 2 of 15
6. (board person8 plane3 city7)
   deleted: (at person8 city7)
   added: (in person8 plane3)
   goals met: 2 of 15
7. (refuel plane3 city7 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 2 of 15
8. (debark person14 plane3 city7)
   deleted: (in person14 plane3)
   added: (at person14 city7)
   goals met: 3 of 15
9. (fly plane3 city7 city1 fl1 fl0)
   deleted: (at plane3 city7) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 3 of 15
10. (debark person8 plane3 city1)
   deleted: (in person8 plane3)
   added: (at person8 city1)
   goals met: 4 of 15
11. (board person11 plane3 city1)
   deleted: (at person11 city1)
   added: (in person11 plane3)
   goals met: 4 of 15
12. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 4 of 15
13. (fly plane3 city1 city0 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 4 of 15
14. (debark person11 plane3 city0)
   deleted: (in person11 plane3)
   added: (at person11 city0)
   goals met: 5 of 15
15. (board person3 plane2 city10)
   deleted: (at person3 city10)
   added: (in person3 plane2)
   goals met: 5 of 15
16. (board person15 plane2 city10)
   deleted: (at person15 city10)
   added: (in person15 plane2)
   goals met: 5 of 15
17. (fly plane2 city10 city11 fl1 fl0)
   deleted: (at plane2 city10) (fuel-level plane2 fl1)
   added: (at plane2 city11) (fuel-level plane2 fl0)
   goals met: 5 of 15
18. (board person9 plane2 city11)
   deleted: (at person9 city11)
   added: (in person9 plane2)
   goals met: 5 of 15
19. (refuel plane2 city11 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 15
20. (board person7 plane2 city11)
   deleted: (at person7 city11)
   added: (in person7 plane2)
   goals met: 5 of 15
21. (debark person3 plane2 city11)
   deleted: (in person3 plane2)
   added: (at person3 city11)
   goals met: 6 of 15
22. (debark person15 plane2 city11)
   deleted: (in person15 plane2)
   added: (at person15 city11)
   goals met: 7 of 15
23. (zoom plane1 city8 city9 fl3 fl2 fl1)
   deleted: (at plane1 city8) (fuel-level plane1 fl3)
   added: (at plane1 city9) (fuel-level plane1 fl1)
   goals met: 7 of 15
24. (board person12 plane1 city9)
   deleted: (at person12 city9)
   added: (in person12 plane1)
   goals met: 7 of 15
25. (board person10 plane1 city9)
   deleted: (at person10 city9)
   added: (in person10 plane1)
   goals met: 7 of 15
26. (fly plane2 city11 city1 fl1 fl0)
   deleted: (at plane2 city11) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 7 of 15
27. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 7 of 15
28. (debark person9 plane2 city1)
   deleted: (in person9 plane2)
   added: (at person9 city1)
   goals met: 8 of 15
29. (fly plane1 city9 city0 fl1 fl0)
   deleted: (at plane1 city9) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 8 of 15
30. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 8 of 15
31. (debark person12 plane1 city0)
   deleted: (in person12 plane1)
   added: (at person12 city0)
   goals met: 9 of 15
32. (fly plane1 city0 city6 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city6) (fuel-level plane1 fl0)
   goals met: 9 of 15
33. (debark person10 plane1 city6)
   deleted: (in person10 plane1)
   added: (at person10 city6)
   goals met: 10 of 15
34. (board person1 plane1 city6)
   deleted: (at person1 city6)
   added: (in person1 plane1)
   goals met: 10 of 15
35. (refuel plane1 city6 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 15
36. (fly plane2 city1 city4 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 10 of 15
37. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 15
38. (board person5 plane2 city4)
   deleted: (at person5 city4)
   added: (in person5 plane2)
   goals met: 10 of 15
39. (fly plane2 city4 city3 fl1 fl0)
   deleted: (at plane2 city4) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 10 of 15
40. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 15
41. (debark person5 plane2 city3)
   deleted: (in person5 plane2)
   added: (at person5 city3)
   goals met: 11 of 15
42. (fly plane2 city3 city5 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city5) (fuel-level plane2 fl0)
   goals met: 11 of 15
43. (refuel plane2 city5 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 15
44. (board person16 plane2 city5)
   deleted: (at person16 city5)
   added: (in person16 plane2)
   goals met: 11 of 15
45. (fly plane2 city5 city2 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 11 of 15
46. (refuel plane2 city2 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 15
47. (debark person16 plane2 city2)
   deleted: (in person16 plane2)
   added: (at person16 city2)
   goals met: 12 of 15
48. (fly plane2 city2 city9 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city9) (fuel-level plane2 fl0)
   goals met: 12 of 15
49. (debark person7 plane2 city9)
   deleted: (in person7 plane2)
   added: (at person7 city9)
   goals met: 13 of 15
50. (fly plane1 city6 city1 fl1 fl0)
   deleted: (at plane1 city6) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 13 of 15
51. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 13 of 15
52. (debark person1 plane1 city1)
   deleted: (in person1 plane1)
   added: (at person1 city1)
   goals met: 14 of 15
53. (fly plane1 city1 city8 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city8) (fuel-level plane1 fl0)
   goals met: 14 of 15
54. (board person4 plane1 city8)
   deleted: (at person4 city8)
   added: (in person4 plane1)
   goals met: 14 of 15
55. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 14 of 15
56. (fly plane1 city8 city1 fl1 fl0)
   deleted: (at plane1 city8) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 14 of 15
57. (debark person4 plane1 city1)
   deleted: (in person4 plane1)
   added: (at person4 city1)
   goals met: 15 of 15
